UF4OVER/STM32F407_LM5175/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TEMP_SCL_Pin GPIO_PIN_10
#define TEMP_SCL_GPIO_Port GPIOB
#define TEMP_SDA_Pin GPIO_PIN_11
#define TEMP_SDA_GPIO_Port GPIOB
#define LED3_Pin GPIO_PIN_12
#define LED3_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_13
#define LED2_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_14
#define LED1_GPIO_Port GPIOB
#define KEY_7_Pin GPIO_PIN_8
#define KEY_7_GPIO_Port GPIOD
#define KEY_7_EXTI_IRQn EXTI9_5_IRQn
#define KEY_6_Pin GPIO_PIN_9
#define KEY_6_GPIO_Port GPIOD
#define KEY_6_EXTI_IRQn EXTI9_5_IRQn
#define KEY_5_Pin GPIO_PIN_10
#define KEY_5_GPIO_Port GPIOD
#define KEY_5_EXTI_IRQn EXTI15_10_IRQn
#define KEY_4_Pin GPIO_PIN_11
#define KEY_4_GPIO_Port GPIOD
#define KEY_4_EXTI_IRQn EXTI15_10_IRQn
#define KEY_3_Pin GPIO_PIN_12
#define KEY_3_GPIO_Port GPIOD
#define KEY_3_EXTI_IRQn EXTI15_10_IRQn
#define KEY_2_Pin GPIO_PIN_13
#define KEY_2_GPIO_Port GPIOD
#define KEY_2_EXTI_IRQn EXTI15_10_IRQn
#define KEY_1_Pin GPIO_PIN_14
#define KEY_1_GPIO_Port GPIOD
#define KEY_1_EXTI_IRQn EXTI15_10_IRQn
#define LCD_BLK_Pin GPIO_PIN_4
#define LCD_BLK_GPIO_Port GPIOD
#define LCD_CS_Pin GPIO_PIN_5
#define LCD_CS_GPIO_Port GPIOD
#define LCD_DC_Pin GPIO_PIN_6
#define LCD_DC_GPIO_Port GPIOD
#define LCD_RES_Pin GPIO_PIN_7
#define LCD_RES_GPIO_Port GPIOD
#define LCD_SCL_Pin GPIO_PIN_3
#define LCD_SCL_GPIO_Port GPIOB
#define LCD_SDA_Pin GPIO_PIN_5
#define LCD_SDA_GPIO_Port GPIOB
#define CUR_SCL_Pin GPIO_PIN_6
#define CUR_SCL_GPIO_Port GPIOB
#define CUR_SDA_Pin GPIO_PIN_7
#define CUR_SDA_GPIO_Port GPIOB
#define OUT_CTRL_Pin GPIO_PIN_1
#define OUT_CTRL_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
